<style scoped>
    .main {
        background-color: #fff;
    }

    .section-title {
        text-align: center;
        color: #36aed5;
        margin: 0px;
        padding: 10px;
        background-color: #e6edf0;
    }

     .section-title p{
        display: inline-block;
     }

    .section-title img {
        float:right;
        display: inline-block;
        width: 28px;
        height:21px;
    }

    .agree{
        border-top: 1px solid #e5e5e5;
        margin: 0px 15px;
        padding: 10px 0px;
    }

    .agree a {
        color: #36aed5;
    }

    .submit-button{
        padding: 0px 10px;
        background-color: #fff;
        margin-top: 10px;
        margin-bottom: 10px;
        height: 45px;
    }
    .dialog-div {
        height:400px;
        padding:15px 0;
        overflow:scroll;
        -webkit-overflow-scrolling:touch;
    }

    .dialog-div h2 {
        padding-bottom: 10px;
    }

</style>

<template>
    <div class="main">
        <group :gutter='0'>
            <group-title  class="section-title">
                <p>投保人信息</p>
                <img src="../../assets/camera.png" @click='takePhotoToUserInformation(1)'>
            </group-title>

            <x-input
            title="姓名"
            placeholder="请输入投保人姓名"
            v-model="policyHolder.name"
            text-align="right"
            placeholder-align="right"
            @on-change='policyHolderNameChange'
            :is-type="userNameRules">
            </x-input>

            <cell title="身份证有效期"
            @click.native='showPolicyHolderIdentityDate = true' is-link>
                <span>{{policyHolder.expiredDate}}</span>
            </cell>

            <div v-transfer-dom>
                <popup v-model="showPolicyHolderIdentityDate">
                    <datetime-view
                    v-model='policyHolder.expiredDate'
                    @on-change='policyHolderIdentityDateChange'
                    :startDate='startDate'
                    :end-date='endDate'
                    format='YYYY-MM-DD'>
                    </datetime-view>
                </popup>
            </div>

            <x-input
            title="身份证号码"
            placeholder="请输入投保人证件号码"
            v-model="policyHolder.identity"
            text-align="right"
            placeholder-align="right"
            @on-change='policyHolderIdentityChange'
            :is-type="identityRules">
            </x-input>

            <cell title="出生日期"
            @click.native='showPolicyHolderBirthDate = true' is-link>
                <span>{{policyHolder.birth}}</span>
            </cell>

            <div v-transfer-dom>
                <popup v-model="showPolicyHolderBirthDate">
                    <datetime-view
                    v-model='policyHolder.birth'
                    @on-change='policyHolderBirthDateChange'
                    :min-year='1900'
                    :max-year='new Date().getFullYear()'
                    format='YYYY-MM-DD'>
                    </datetime-view>
                </popup>
            </div>

            <popup-radio title="性别"
            :options="sexOptions"
            @on-change='policyHolderGenderChange'
            v-model="policyHolder.gender">
            </popup-radio>

            <x-input
            title="电子邮件"
            placeholder="请输入"
            v-model="flowData.policyHolderEmail"
            text-align="right"
            placeholder-align="right"
            :is-type="userEmailRules">
            </x-input>

            <popup-radio title="联系地址"
            :options="provinceOptions"
            v-model="province">
            </popup-radio>

            <x-input
            title=""
            placeholder="请填写详细地址，不少于5个字"
            @on-change='policyHolderAddressChange'
            v-model="flowData.policyHolderAddress"
            placeholder-align="left"
            :is-type="adressRules">
            </x-input>

            <x-input
            title="手机号码"
            placeholder="请录入投保人手机号码"
            v-model="flowData.policyHolderMobile"
            placeholder-align="right"
            text-align="right"
            :is-type="mobileRules">
            </x-input>

            <group-title  class="section-title">
                <p>被保人信息</p>
                <img src="../../assets/camera.png" @click='takePhotoToUserInformation(2)'>
            </group-title>

            <popup-radio title="与投保人关系"
            :options="insuredRelationOptions"
            @on-change='insuredRelationChange'
            v-model="flowData.insuredRelation">
            </popup-radio>

            <x-input
            title="姓名"
            placeholder="请输入被保人姓名"
            :disabled='flowData.insuredRelation == "本人"'
            v-model="insured.name"
            text-align="right"
            placeholder-align="right"
            :is-type="userNameRules">
            </x-input>

            <cell title="身份证有效期"
            class='cell-date'
            @click.native='flowData.insuredRelation == "本人" ? showInsuredIdentityDate = false : showInsuredIdentityDate = true' is-link>
                <span>{{insured.expiredDate}}</span>
            </cell>

            <div v-transfer-dom>
                <popup v-model="showInsuredIdentityDate">
                    <datetime-view
                    v-model='insured.expiredDate'
                    :startDate='startDate'
                    :end-date='endDate'
                    format='YYYY-MM-DD'>
                    </datetime-view>
                </popup>
            </div>

            <x-input
            title="身份证号码"
            placeholder="请输入被保人证件号码"
            v-model="insured.identity"
            :disabled='flowData.insuredRelation == "本人"'
            placeholder-align="right"
            text-align="right"
            @on-change='insuredIdentityChange'
            :is-type="identityRules">
            </x-input>

            <cell title="出生日期"
            @click.native='flowData.insuredRelation == "本人" ? showInsuredBirthDate = false : showInsuredBirthDate = true' is-link>
                <span>{{insured.birth}}</span>
            </cell>

            <div v-transfer-dom>
                <popup v-model="showInsuredBirthDate">
                    <datetime-view
                    v-model='insured.birth'
                    :min-year='1900'
                    :max-year='new Date().getFullYear()'
                    format='YYYY-MM-DD'>
                    </datetime-view>
                </popup>
            </div>

            <popup-radio title="性别"
            :options="sexOptions"
            :readonly='flowData.insuredRelation == "本人"'
            v-model="insured.gender">
            </popup-radio>

            <popup-radio title="联系地址"
            :options="provinceOptions"
            :readonly='flowData.insuredRelation == "本人"'
            v-model="province">
            </popup-radio>

            <x-input
            title=""
            placeholder="请填写详细地址，不少于5个字"
            :disabled='flowData.insuredRelation == "本人"'
            v-model="flowData.insuredAddress"
            placeholder-align="left"
            :is-type="adressRules">
            </x-input>

            <x-switch class='switch-vertical-middle' title="有无社会基本医疗保险" v-model="flowData.socialInsuFlag"></x-switch>

            <div class="agree">
                <check-icon :value.sync="agreeCheck" @click.native='agreeTotalDeclare'>我已阅读并理解</check-icon>
                <a @click='showDeclare = true'>《投保申明》</a>、
                <a @click='showAttention = true'>《理赔须知》</a>和
                <a @click='showProvision = true'>《保险条款》</a>，并同意遵守。
            </div>
            <section class="submit-button">
                <x-button type='primary' @click.native='submitInfo'>确定</x-button>
            </section>

            <x-dialog v-model="showDeclare"
            :dialog-style="{'max-width': '90%', width: '90%' }">
                <div class="dialog-div">
                    <h3>投保声明</h3>
                    <ul>
                        <li>1. 本人已知晓本保险由利安人寿保险股份有限公司（以下简称“利安人寿”）承保，利安人寿在江苏、安徽、河南、四川、北京、山东、河北、上海地区设有分支机构，被保险人的常住地需在上述地区。</li>
                        <li>2. 利安人寿已对投保险种的各项保险条款内容履行了说明义务，并对保险责任、保险期间、责任免除条款、免赔额、免赔率、比例赔付、退保条款、犹豫期条款、等待期条款、理赔条款等履行了明确说明义务，上述内容本人均已阅读和理解，并同意遵守。</li>
                        <li>3. 本人已知晓本人必须真实、完整提供本投保申请中所要求的各项信息。本人经仔细审阅后确认上述内容均属实，与之有关的资料均完整、确实无误，并由本人亲自提供。本人对现在及过去的职业状况、健康状况、生活方式和习惯均无隐瞒或遗漏，否则将可能影响合同的成立和正常履行。</li>
                        <li>4. 本人已知晓本保险合同自贵公司审核投保申请后同意承保、收取首期保险费并签发保险单的次日零时起生效，具体生效日以保险单所载日期为准。利安人寿不承担保险合同生效前的保险事故责任。</li>
                        <li>5. 根据《中华人民共和国合同法》，数据电文是合法的合同表现形式，电子保单与纸质保单具有同等法律效力。本人已知晓本保险仅提供电子保单，电子保单将由利安人寿于保单签发当日发送至本人授权电子邮箱，并可以通过利安人寿官网下载。本人同意保单签发日期作为电子保单签收日期。</li>
                        <li>6. 本人已知晓自电子保单签收日期次日起10日内为犹豫期，犹豫期内如本人申请解约，利安人寿将按合同条款约定全额无息退还本人所交的保险费。如本人在犹豫期后申请解约，利安人寿将按合同条款约定支付退保金，详见保险条款。</li>
                        <li>7. 本人授权利安人寿可从任何单位、组织和个人就有关保险事宜查询、索取与本人有关资料和证明，利安人寿对个人资料承担保密义务。</li>
                        <li>8. 本人已知晓利安人寿采集投保人、被保险人、指定受益人的相关信息将用于订立和履行本保险合同并提供相关服务，以及提供其他保险产品或服务等用途。在中国法律允许或要求的范围内，本人同意并授权利安人寿将上述信息及保单信息提供给相关监管机构及行业协会以做合理利用；前述信息也可出于上述用途而向利安人寿委托的第三方披露以完成有关目的。此授权包括利安人寿与本次投保中为本人服务的经纪人共享信息的情形。</li>
                        <li>9. 本人已知晓暂不接受非社保用户投保。</li>
                    </ul>
                </div>
                <section class="submit-button">
                    <x-button type='primary' @click.native='showDeclare = false ; agreeDeclareCheck = true'>我已阅读《投保声明》</x-button>
                </section>
            </x-dialog>

            <x-dialog v-model="showAttention"
            :dialog-style="{'max-width': '90%', width: '90%'}">
                <div class="dialog-div">
                    <h3>理赔须知</h3>
                    <ul>
                        <li>一、理赔流程</li>
                        <li>第一步：登陆利安人寿官网（http://www.lianlife.com），下载理赔申请书并填写。</li>
                        <li>1. 申请书上须有被保险人签名。</li>
                        <li>2. 若多个被保险人一起申请，需每人分别填写理赔申请书。</li>
                        <li>下载路径如下：利安人寿官网→客户中心→常用下载→理赔申请书（非团体医疗业务）</li>
                        <li>第二步：准备材料：</li>
                        <li>1. 申请人（受益人）有效身份证件（复印件）</li>
                        <li>2. 未成年人出险，需提供与申请人的关系证明（复印件）</li>
                        <li>3. 病历资料，包括门诊病历、出院小结/诊断证明、病理及其他各项检查检验报告（原件）</li>
                        <li>4. 医疗费用发票（原件）及费用明细清单</li>
                        <li>5. 银行账户信息：包括开户行、户名、账号（复印件）</li>
                        <li>6. 所能提供的与确认保险事故的性质、原因等有关的其它证明和资料（原件）</li>
                        <li>第三步：请将理赔申请书及理赔材料邮寄到如下地址（邮费由您负担）</li>
                        <li>地址：上海市普陀区凯旋北路1288号上海环球港A座35层；邮编：200333</li>
                        <li>温馨提示：为避免邮件丢失，建议您复印留存一份理赔资料，并保留快递单。</li>
                        <li>二、注意事项</li>
                        <li>1. 我们在接收到您的材料后将尽快处理，预计15个工作日内审核完毕。</li>
                        <li>2. 我们会对您投保时的健康告知进行核实，若不符合实际情况，可能影响您的理赔结论。</li>
                        <li>3. 审核中，若需要您补充其他材料等情况，烦请您予以配合，以便我们尽早完成理赔。</li>
                        <li>4. 若您对理赔结果有异议，可拨打<a href="tel://400-808-0080">400-808-0080</a>进行咨询。</li>
                    </ul>
                </div>
                <section class="submit-button">
                    <x-button type='primary' @click.native='showAttention = false ; agreeAttentionCheck = true'>我已阅读《理赔须知》</x-button>
                </section>
            </x-dialog>

            <x-dialog v-model="showProvision"
            :dialog-style="{'max-width': '90%', width: '90%' }">
                <div class="dialog-div">
                    <h3>
                    利安人寿保险股份有限公司
                    畅享人生医疗保险条款
                    </h3>
                    <p style="text-align: center;"><span style="font-size: 12px;">阅 读 指 引</span><br>本阅读指引有助于理解条款，对本合同内容的解释以条款为准。</p>
                    <div class="notice">
                        <ul class="noticeTitle2">
                            <li>
                                <h3>您拥有的重要权益</h3>
                                <ul>
                                    <li>
                                        <a ng-click="goto(1.4)">
                                            签收本合同次日起10日（即犹豫期）内您若要求退保，我们全额退还保险费
                                            <span>………………………………………1.4</span>
                                        </a>
                                    </li>
                                    <li>
                                        <a ng-click="goto(2.3)">
                                            本合同提供的保障在保险责任条款中列明
                                            <span>………………………………………2.3</span>
                                        </a>
                                    </li>
                                    <li>
                                        <a ng-click="goto(5.1)">
                                            您有退保的权利
                                            <span>………………………………………5.1</span>
                                        </a>
                                    </li>
                                </ul>
                            </li>
                            <li>
                                <h3>您应当特别注意的事项</h3>
                                <ul>
                                    <li>
                                        <a ng-click="goto(2.6)">
                                            本合同有责任免除条款，请您注意
                                            <span>………………………………………2.6</span>
                                        </a>
                                    </li>
                                    <li>
                                        <a ng-click="goto(3.2)">
                                            保险事故发生后，请您及时通知我们
                                            <span>………………………………………3.2</span>
                                        </a>
                                    </li>
                                    <li>
                                        <a ng-click="goto(5.1)">
                                            退保会给您造成一定的损失，请您慎重决策
                                            <span>………………………………………5.1</span>
                                        </a>
                                    </li>
                                    <li>
                                        <a ng-click="goto(6.1)">
                                            您有如实告知的义务
                                            <span>………………………………………6.1</span>
                                        </a>
                                    </li>
                                    <li>
                                        <a ng-click="goto(7)">
                                            我们对一些重要术语进行了解释，并作了显著标识，请您注意
                                            <span>………………………………………7</span>
                                        </a>
                                    </li>
                                </ul>
                            </li>
                        </ul>
                        <div class="list">
                        <h3>条款目录</h3>
                        <ul>
                            <li class="column">
                                <h5>1．您与我们订立的合同</h5>
                                <ul>
                                    <li>1.1 合同构成 </li>
                                    <li>1.2 合同成立与生效</li>
                                    <li>1.3 投保范围</li>
                                    <li>1.4 犹豫期</li>
                                </ul>
                                <h5>
                                2．我们提供的保障
                                </h5>
                                <ul>
                                    <li>2.1 保险期间</li>
                                    <li>2.2 保障计划及保障区域</li>
                                    <li>2.3 保险责任</li>
                                    <li>2.4 免赔额 </li>
                                    <li>2.5 补偿原则</li>
                                    <li>2.6 责任免除</li>
                                </ul>
                                <h5>
                                3．如何申请领取保险金
                                </h5>
                                <ul>
                                    <li>3.1 受益人</li>
                                    <li>3.2 保险事故通知</li>
                                    <li>3.3 保险金申请</li>
                                    <li>3.4 保险金给付</li>
                                    <li>3.5 诉讼时效</li>
                                </ul>
                            </li>
                            <li class="column">
                                <h5>
                                4. 如何支付保险费
                                </h5>
                                <ul>
                                    <li>4.1 保险费的支付</li>
                                </ul>
                                <h5>5．如何解除保险合同</h5>
                                <ul>
                                    <li>5.1 您解除合同的手续及风险</li>
                                </ul>
                                <h5>6．其他需要关注的事项 </h5>
                                <ul>
                                    <li>6.1 明确说明与如实告知</li>
                                    <li>6.2 我们合同解除权的限制</li>
                                    <li>6.3职业或工种的确定与变更</li>
                                    <li>6.4 年龄和性别确定与错误处理</li>
                                    <li>6.5 合同内容变更</li>
                                    <li>6.6 联系方式变更</li>
                                    <li>6.7 争议处理</li>
                                </ul>
                                <h5>7．释义</h5>
                                <ul>
                                    <li>7.1 周岁</li>
                                    <li>7.2 连续投保</li>
                                    <li>7.3 同时参保</li>
                                </ul>
                            </li>
                            <li class="column">
                                <ul>
                                    <li>7.4 有效身份证件</li>
                                    <li>7.5 住院</li>
                                    <li>7.6 意外伤害</li>
                                    <li>7.7 医疗必需且合理</li>
                                    <li>7.8 住院医疗费用</li>
                                    <li>7.9 感染艾滋病病毒或患艾滋病</li>
                                    <li>7.10 既往疾病</li>
                                    <li>7.11 毒品</li>
                                    <li>7.12 斗殴</li>
                                    <li>7.13 酒后驾驶</li>
                                    <li>7.14 无合法有效驾驶证驾驶</li>
                                    <li>7.15 无有效行驶证</li>
                                    <li>7.16 机动车</li>
                                    <li>7.17 潜水</li>
                                    <li>7.18 攀岩</li>
                                    <li>7.19 探险</li>
                                    <li>7.20 武术比赛</li>
                                    <li>7.21 特技表演</li>
                                    <li>7.22 遗传性疾病</li>
                                    <li>7.23 先天性畸形、变形或染色体异常</li>
                                    <li>7.24 现金价值</li>
                                </ul>
                            </li>
                            <li style="color: red;margin-left: 0">附表：畅享人生医疗保险计划表 </li>
                        </ul>
                    </div>
                    <div class="content text-pad">
                        <div class="text-center">
                            <h3>
                            利安人寿保险股份有限公司
                            畅享人生医疗保险条款
                            </h3>
                            <p>“畅享人生医疗保险”简称“畅享人生医疗”。在本保险条款中，“您”指投保人，“我们”指利安人寿保险股份有限公司，“本合同”指您与我们之间订立的“畅享人生医疗保险合同”。</p>
                        </div>
                        <ul>
                            <li>
                                <h3>您与我们订立的合同</h3>
                                <table>
                                    <tbody>
                                        <tr class="strong"><td>1.1合同构成</td></tr>
                                        <tr><td>本合同是您与我们约定保险权利义务关系的协议，包括本保险条款、保险单、投保单及其他投保文件、合法有效的声明、批注、批单及其他您与我们共同签订的书面协议。电子保险单、电子投保单及其他您与我们共同认可的电子文档具有与纸质文件同等效力。</td></tr>
                                        <tr class="strong"><td>1.2合同成立与生效</td></tr>
                                        <tr><td>您提出保险申请、我们同意承保，本合同成立。本合同自我们同意承保、收取保险费并签发保险单开始生效，具体生效日以保险单所载的日期为准。</td></tr>
                                        <tr class="strong"><td>1.3投保范围</td></tr>
                                        <tr><td>本合同接受的被保险人为投保时年龄范围在出生满28天至55周岁之间，且符合我们当时规定的其他投保条件的人员。对于连续投保4年以上的被保险人,您有权利为其持续续保至59周岁。被保险人为非中华人民共和国国籍的，需持有中华人民共和国政府部门签发的工作签证，或拥有中华人民共和国境内居留证或长期居住权，并提供中华人民共和国境内固定居住地址。被保险人的家庭成员若满足上述条件，可以与被保险人同时参保本保险。家庭成员仅指投保时年龄不超过55周岁，身体健康，能在中国正常工作、劳动或者生活的被保险人的配偶，以及投保时年龄不超过18周岁，身体健康，能在中国正常生活、学习，经济上完全依赖被保险人的被保险人的未婚子女（其中被保险人的配偶最高可续保至59周岁，被保险人的未婚子女最高可续保至23周岁）。</td></tr>
                                        <tr id="1.4" class="strong"><td>1.4犹豫期</td></tr>
                                        <tr><td>自您签收本合同次日起，有10日的犹豫期。在此期间，请您认真审视本合同，如果您认为本合同与您的需求不相符，您可以在此期间提出解除本合同，我们将退还您所支付的保险费。解除合同时，您需要填写申请书，并提供您的保险合同及有效身份证件。自我们收到您解除合同的书面申请时起，本合同即被解除，对于本合同解除前发生的保险事故，我们不承担保险责任。</td></tr>
                                    </tbody>
                                </table>
                            </li>
                            <li>
                                <h3>我们提供的保障 </h3>
                                <table>
                                    <tbody>
                                        <tr class="strong"><td>2.1保险期间</td></tr>
                                        <tr><td>本合同的保险期间由您在投保时与我们约定并在保险单上载明,最长不超过1年。</td></tr>
                                        <tr class="strong"><td>2.2保障计划及保障区域</td></tr>
                                        <tr><td>本合同提供两种保障计划，由您和我们约定并在保险单上载明，在本合同保险期间内不得变更。本合同保障计划的年度总限额、各项保险金限额、在医院治疗给付保险金的给付比例见附表。本合同的保障区域为中国大陆。本合同约定的被保险人的各项医疗费用，必须发生于中国大陆二级或二级以上公立医院（不含特需及外宾病房）。</td></tr>
                                        <tr class="strong" id="2.3"><td>2.3保险责任</td></tr>
                                        <tr>
                                            <td>
                                                在本合同保险期间内，且本合同有效的前提下，我们根据投保时您与我们约定的保障计划，在年度总限额范围内按以下约定承担相应的保险责任：
                                                等待期 您首次投保或非连续投保本保险时，被保险人因腺样体肥大、疝气、扁桃腺的疾病或女性生殖器官的疾病需要住院治疗或特殊门诊治疗的，自本保险合同生效之日起90日为等待期；被保险人因其他疾病需要住院治疗或特殊门诊治疗的，自本合同生效日起30日为等待期。续保或者因意外伤害进行治疗的无等待期。被保险人在等待期内发生的保险事故，我们不承担给付保险金的责任。住院医疗费用保险金 被保险人因疾病或意外伤害经医院确诊必须住院治疗的，对于住院期间发生的医疗必需且合理的住院医疗费用，我们按对应的给付比例扣除年度免赔额，在年限额、日限额及最高给付日数范围内给付住院医疗费用保险金。本项保险金的给付比例、年限额、日限额及最高给付日数见附表。在每一保单年度内，我们仅对被保险人住院累计180日内发生的上述各项费用承担保险责任。 对于本合同保险期间届满前发生的且延续至本合同保险期间届满日后30日内的医疗必需且合理的住院医疗费用，我们仍然按照上述给付比例，在各项费用的年限额和日限额范围内给付住院医疗费用保险金，但累计给付日数以各项责任对应的最高给付日数为限，各项费用累计给付金额以各对应项费用最高给付金额为限。特殊门诊医疗费用保险金 被保险人因疾病或意外伤害必须在医院接受门诊肾透析、门诊癌症放化疗或器官移植后的门诊抗排异治疗的，对于每次在医院治疗发生的医疗必需且合理的特殊门诊医疗费用，我们按对应的给付比例扣除年度免赔额，在年限额范围内给付特殊门诊医疗费用保险金。本项保险金的给付比例及年限额见附表。
                                            </td>
                                        </tr>
                                        <tr class="strong"><td>2.4免赔额</td></tr>
                                        <tr><td>本合同约定的年度免赔额由您在投保时与我们约定并在保险单上载明。如果保单年度内被保险人从其他途径累计已获得的医疗费用补偿金额未超过年度免赔额，那么免赔额等于年度免赔额；如果保单年度内被保险人从其他途径累计已获得的医疗费用补偿金额超过年度免赔额，那么免赔额等于保单年度从其他渠道内累计已获得的医疗费用补偿金额。其他途径获得的医疗费用补偿包含已从社会医疗保险、公费医疗、商业性医疗保险、其他政府机构或者社会福利机构获得医疗费用补偿。如果被保险人以有社会医疗保险身份投保，但未以社会医疗保险身份就诊或者结算，我们将扣除社会医疗保险可报销但被保险人未先行报销的医疗费用的20%部分。</td></tr>
                                        <tr class="strong"><td>2.5补偿原则</td></tr>
                                        <tr><td>我们在向受益人给付保险金时，若被保险人所发生的属于本合同保险责任范围内的医疗费用已通过工作单位、本公司在内的任何商业保险机构获得了补偿或赔偿，且该补偿或赔偿金额与我们按本合同约定给付的保险金之和超过了被保险人实际发生的医疗费用，我们将按被保险人实际发生的医疗费用扣除被保险人从其他途径获得的补偿或赔偿金额后的余额向受益人给付保险金，即包括本合同在内的各种途径所给付的所有补偿或赔偿金额之和不得超过被保险人实际发生的医疗费用。</td></tr>
                                        <tr id="2.6" class="strong"><td>2.6责任免除</td></tr>
                                        <tr>
                                            <td>
                                                因下列情形之一造成被保险人医疗费用支出或发生符合下列情形描述的费用的，我们不承担给付保险金的责任：<br>
                                                （一）非疾病治疗类
                                                <br>1．各种美容整形项目和整形手术：包括但不限于皮肤色素沉着、对皮肤表面无囊肿形成或无脓肿的痤疮治疗、红斑痤疮治疗;良性皮肤损害（雀斑、老年斑、痣、疣等）的治疗和去除；对浅表静脉曲张、蜘蛛脉、除瘢痕疙瘩型外的其它瘢痕、纹身去除、皮肤变色的治疗或手术；激光美容、除皱、除眼袋、开双眼皮、治疗斑秃、白发、秃发、脱发、植毛、脱毛、隆鼻、隆胸费用；
                                                <br>2．各种矫形及生理缺陷的手术和检查治疗项目，包括但不限于平足及各种非功能性整容、矫形手术费用；
                                                <br>3．各种健美治疗项目，包括但不限于营养、减肥、增胖、增高费用；
                                                <br>4．各种预防保健性项目，包括但不限于保健按摩、自动按摩床治疗、药物蒸气治疗、药浴、体疗健身、各种疫苗预防接种、预防注射以及疾病普查费用；
                                                <br>5．各种医疗咨询和健康预测，包括但不限于健康咨询、家庭咨询、婚姻咨询、性咨询、婚前咨询、心理咨询费用；
                                                <br>6．各种医疗鉴定，包括但不限于医疗事故鉴定、精神病鉴定、孕妇胎儿性别鉴定、各种验伤鉴定、亲子鉴定、遗传基因鉴定费用。
                                                <br>（二）生殖治疗类
                                                <br>1．人工辅助生殖（分娩费用除外）、男女节育；
                                                <br>2．输精管或输卵管结扎等绝育术；
                                                <br>3．性功能障碍治疗；
                                                <br>4．非紧急情况下的堕胎，因心理或社会原因实施的堕胎及造成的相关并发症，以及选择性手术分娩；
                                                <br>5．不育症的检查和治疗；
                                                <br>6．绝育恢复手术；
                                                <br>7．变性手术；
                                                <br>8．用于提高性功能的药物；
                                                <br>9．生育、分娩前的培训；
                                                <br>10．与不育或生育相关的任何活细胞冷冻贮藏、植入和再植入费用。
                                                <br>（三）治疗项目类
                                                <br>1．除心脏瓣膜、人工晶体、人工关节之外的人工器官材料费、安装和置换等费用；
                                                <br>2．性病治疗相关费用，被保险人感染艾滋病病毒或患艾滋病期间因所有疾病所导致的医疗费用；
                                                <br>3．依据具有相应资格的医生判断，无医学必要性的检查和治疗；
                                                <br>4．在健康水疗院、自然治疗诊所或类似疗养机构接受的治疗，或以隶属于该类机构、登记为“护理病房”的私人病床形式接受的治疗；
                                                <br>5．为休息、观察而实施的环境疗法，在任何长期护理机构、矿泉疗养地、水疗院门诊、康复机构、疗养院、养老院等非本合同规定的医疗机构接受的服务或治疗；
                                                <br>6．近视、斜视矫形术费用，包皮环切术、包皮剥离术、包皮气囊扩张术；
                                                <br>7．睡眠呼吸暂停，睡眠相关的呼吸异常、鼾症或失眠 ；
                                                <br>8．牙齿修复、牙齿整形，以及非因意外事故而进行的牙齿、牙周、牙床治疗及手术；。
                                                <br>（四）服务设施及医学材料类
                                                <br>1．使用电话、电炉、煤气、食品保温箱等费用；
                                                <br>2．遗体料理费、遗体冷藏费；
                                                <br>3．陪护费、加床费（本合同约定属于保险责任范围内的除外）、护工费、洗理费及各种与诊疗无直接关系的费用（包括但不限于脸盆、卫生塑料及卫生纸费）；
                                                <br>4．耐用医疗设备的购买或租赁费；
                                                <br>5．定制或改造任何交通工具、洗浴设备或者住宅设备；
                                                <br>6．所有非处方医疗器械；
                                                <br>7．非必需的假体、矫正器具、支具或相似的器具。
                                                <br>（五）药品费用
                                                <br>1．自购药品（自购药品指被保险人未经过医院所属的具有执业医生资格的医生开具医嘱，自行至药房、超市、医院所属商业药房等地点购买的药品）；
                                                <br>2．营养性复合维生素，矿物质、中草药、膏方及其它营养保健药费，试验或研究性质的药物费用；
                                                <br>3．医生开具的、超过90天部分的药品（包含维生素）费用。
                                                <br>（六）特定医疗费用
                                                <br>1．超出通常惯例的医疗费用；
                                                <br>2．为获得治疗发生的交通费，本合同列明的本地救护车费及紧急医疗运送除外；
                                                <br>3．保险期间届满后发生的医疗费用，包括在此后按疗程使用的处方药品费用（本合同约定属于保险责任范围内的除外）。
                                                <br>（七）其它
                                                <br>1．被保险人所患既往疾病引起的医疗费用，但在投保时已告知我们并经我们书面同意承保的不在此限；
                                                <br>2．被保险人因精神疾病引起的医疗费用，保险单中特别约定的其他除外疾病引起的医疗费用；
                                                <br>3．被保险人醉酒，主动吸食或注射毒品导致的医疗费用；
                                                <br>4．投保人对被保险人的故意杀害、故意伤害；
                                                <br>5．被保险人故意自伤、故意犯罪、斗殴或者抗拒依法采取的刑事强制措施导致的医疗费用；
                                                <br>6．被保险人酒后驾驶、无合法有效驾驶证驾驶或驾驶无有效行驶证的机动车导致交通意外引起的医疗费用；
                                                <br>7．被保险人参加或从事潜水、滑水、滑雪、轮滑、滑板、滑板车、跳伞、攀岩、蹦极、驾驶滑翔机或滑翔伞、探险、柔道、空手道、跆拳道、马术、拳击武术比赛、摔跤、特技表演、赛马、各种车辆表演、驾驶卡丁车、赛车等高风险运动导致的伤害引起的治疗；
                                                <br>8．被保险人先天性疾病、遗传性疾病、先天性畸形、变形或染色体异常引起的医疗费用；
                                                <br>9．由于职业病、医疗事故引起的医疗费用；
                                                <br>10．核爆炸、核辐射或核污染、化学污染；战争、军事冲突、暴乱或武装叛乱；任何恐怖分子行为；
                                                <br>11．冒名住院、不符合入院标准、挂床住院或住院病人应当出院而拒不出院（从医院确定出院之日起发生的一切医疗费用）。其中挂床住院指被保险人办理正式住院手续的被保险人，在住院期间每日非24小时在床、在院。具体表现包括在住院期间连续若干日无任何治疗，只发生护理费、诊疗费、床位费等情况；
                                                <br>12．被保险人接受实验性治疗，即未经科学或医学认可的医疗。
                                                <br>13.被保险人在中国大陆境内以外地区就医。
                                                <br>14．被保险人参与执行军、警任务。
                                                <br>15.根据法律或政府指导需要进行隔离或检疫的传染病的治疗的费用
                                            </td>
                                        </tr>
                                    </tbody>
                                </table>
                            </li>
                            <li>
                                <h3>如何申请领取保险金 </h3>
                                <table>
                                    <tbody>
                                        <tr class="strong"><td>3.1受益人</td></tr>
                                        <tr><td>除另有指定外，本合同保险金的受益人为被保险人本人。</td></tr>
                                        <tr id="3.2" class="strong"><td>3.2保险事故通知</td></tr>
                                        <tr><td>您或受益人知道保险事故后应当在10日内通知我们。如果您或受益人故意或者因重大过失未及时通知，致使保险事故的性质、原因、损失程度等难以确定的，我们对无法确定的部分，不承担给付保险金的责任，但我们通过其他途径已经及时知道或者应当及时知道保险事故发生或者虽未及时通知但不影响我们确定保险事故的性质、原因、损失程度的除外。</td></tr>
                                        <tr class="strong"><td>3.3保险金申请</td></tr>
                                        <tr><td>在申请保险金时，请按照下列方式办理：保险金申请所需材料 对于住院医疗费用保险金、特殊门诊医疗费用保险金，受益人须填写保险金给付申请书，并提供下列证明和资料：(1)本合同；(2)受益人的有效身份证件；(3)医院出具的入出院证明或门诊证明；(4)医院出具的医疗诊断书及住院或门诊发生医疗费用的原始凭证、医疗费用结算清单、病历；(5)检查化验报告及药品明细和处方；(6)所能提供的与确认保险事故的性质、原因等有关的其他证明和资料。以上各项保险金申请的证明和资料不完整的，我们将及时一次性通知受益人补充提供有关证明和资料。</td></tr>
                                        <tr class="strong"><td>3.4保险金给付</td></tr>
                                        <tr>
                                            <td>
                                                我们在收到保险金给付申请书及合同约定的证明和资料后，将在5日内作出核定；情形复杂的，在30日内作出核定。对属于保险责任的，我们在与受益人达成给付保险金的协议后10日内，履行给付保险金义务。
                                                我们未及时履行前款规定义务的，除支付保险金外，应当赔偿受益人因此受到的损失。前述“损失”是指根据中国人民银行公布的同时期的人民币活期存款基准利率计算的利息损失。
                                                对不属于保险责任的，我们自作出核定之日起3日内向受益人发出拒绝给付保险金通知书并说明理由。
                                                我们在收到保险金给付申请书及有关证明和资料之日起60日内，对给付保险金的数额不能确定的，根据已有证明和资料可以确定的数额先予支付；我们最终确定给付保险金的数额后，将支付相应的差额。
                                            </td>
                                        </tr>
                                        <tr class="strong"><td>3.5保险金给付</td></tr>
                                        <tr><td>受益人向我们请求给付保险金的诉讼时效期间为2年，自其知道或者应当知道保险事故发生之日起计算。</td></tr>
                                    </tbody>
                                </table>
                            </li>
                            <li>
                                <h3>如何支付保险费</h3>
                                <table>
                                    <tbody>
                                        <tr class="strong"><td>4.1保险费的支付 </td></tr>
                                        <tr><td> 您应于投保时一次性支付全部保险费。</td></tr>
                                    </tbody>
                                </table>
                            </li>
                            <li>
                                <h3>如何解除保险合同 </h3>
                                <table>
                                    <tbody>
                                        <tr id="5.1" class="strong"><td>5.1您解除合同的手续及风险</td></tr>
                                        <tr style="text-indent: 0;"><td>(1)保险合同；<br>(2)您的有效身份证件。 自我们收到解除合同申请书时起，本合同终止。我们自收到解除书之日起30日内向您退还保险单的现金价值。对已发生过保险金给付，或已发生本合同约定的保险事故但尚未支付保们不退还保险单的现金价值。您解除合同会遭受一定损失。</td></tr>
                                    </tbody>
                                </table>
                            </li>
                            <li>
                                <h3>其他需要关注的事项 </h3>
                                <table>
                                    <tbody>
                                        <tr class="strong" id="6.1"><td>6.1明确说明与如实告知</td></tr>
                                        <tr><td>订立本合同时，我们应向您说明本合同的内容。对保险条款中免除我们责任的条款，我们在订立合同时应当在投保单、保险单或者其他保险凭证上作出足以引起您注意的提示，并对该条款的内容以书面或者口头形式向您作出明确说明，未作提示或者明确说明的，该条款不产生效力。我们就您和被保险人的有关情况提出询问，您应当如实告知。如果您故意或者因重大过失未履行前款规定的如实告知义务，足以影响我们决定是否同意承保或者提高保险费率的，我们有权解除本合同。如果您故意不履行如实告知义务，对于本合同解除前发生的保险事故，我们不承担给付保险金的责任，并且不退还保险费。如果您因重大过失未履行如实告知义务，对保险事故的发生有严重影响的，对于本合同解除前发生的保险事故，我们不承担给付保险金的责任，但应当退还保险费。我们在合同订立时已经知道您未如实告知的情况的，我们不得解除合同；发生保险事故的，我们承担给付保险金的责任。</td></tr>
                                        <tr class="strong"><td>6.2我们合同解除权的限制</td></tr>
                                        <tr><td>本保险条款“明确说明与如实告知”规定的合同解除权，自我们知道有解除事由之日起，超过30日不行使而消灭。</td></tr>
                                        <tr class="strong"><td>6.3职业或工种的确定与变更</td></tr>
                                        <tr><td>在本合同保险期间内，若被保险人变更其职业或工种的，您或被保险人应于职业或工种变更之日起10日内以书面形式通知我们。<br>(1)被保险人变更后的职业或者工种，依照我们职业分类，其危险程度降低时，我们于收到通知后，向您退还自职业变更之日起应减收的相应保险费；若其危险程度降低但未依上述约定通知我们而发生保险事故的，我们按保险事故发生当时保险单所载的保险金额给付保险金，并退还自职业变更之日起应减收的相应保险费。<br>(2)被保险人变更后的职业或者工种，依照我们职业分类，其危险程度增加时，我们于收到通知后，向您收取自职业变更之日起应加收的相应保险费；若其危险程度增加但未依上述约定通知我们而发生保险事故的，我们按其实收保险费与应收保险费的比例计算并给付保险金。<br>(3)被保险人变更后的职业或者工种依照我们职业分类在拒保范围内的，我们对被保险人所负保险责任自其职业或工种变更之日起终止，并按约定退还其相应的现金价值。如果我们对被保险人已给付过任何保险金，则不退还。若被保险人变更后的职业或者工种在我们的拒保范围内但未依上述约定通知我们而发生保险事故的，我们不负给付保险金的责任，但按约定退还其相应的现金价值。</td></tr>
                                        <tr class="strong"><td>6.4年龄和性别确定与错误处理</td></tr>
                                        <tr><td>您在申请投保时，应将与有效身份证件相符的被保险人的出生日期和性别在投保单上填明，如果发生错误按照下列方式办理：<br>(1)您申报的被保险人年龄不真实，并且其真实年龄不符合本合同约定投保年龄限制的，在保险事故发生之前我们有权解除合同，并向您退还本合同的现金价值。我们行使合同解除权适用“我们合同解除权的限制”的规定。<br>(2)您申报的被保险人年龄或性别不真实，致使您实付保险费少于应付保险费的，我们有权作相应的更正并要求您补交保险费差额。若已经发生保险事故，在给付保险金时按实付保险费和应付保险费的比例给付。<br>(3)您申报的被保险人年龄或性别不真实，致使您实付保险费多于应付保险费的，我们会将多收的保险费退还给您</td></tr>
                                        <tr class="strong"><td>6.5合同内容变更</td></tr>
                                        <tr><td>在本合同有效期内，经您与我们协商一致，可以变更本合同的有关内容。变更本合同的，应当由我们在保险单或者其他保险凭证上批注或者附贴批单，或者由您与我们订立书面的变更协议。</td></tr>
                                        <tr class="strong"><td>6.6联系方式变更</td></tr>
                                        <tr><td>为了保障您的合法权益，您的住所、通讯地址或电话等联系方式变更时，请及时以书面形式或双方认可的其他形式通知我们。若您未以书面形式或双方认可的其他形式通知我们，我们按本合同载明的最后住所、通讯地址或电话等联系方式发送的有关通知，均视为已送达给您。</td></tr>
                                        <tr class="strong"><td>6.7争议处理</td></tr>
                                        <tr><td>本合同履行过程中，双方发生争议不能协商解决的，可以依法向法院提起诉讼。</td></tr>
                                    </tbody>
                                </table>
                            </li>
                            <li>
                                <h3 id="7">释义</h3>
                                <table>
                                    <tbody>
                                        <tr class="strong"><td>7.1周岁</td></tr>
                                        <tr><td>指按有效身份证件中记载的出生日期计算的年龄，自出生之日起为零周岁，每经过一年增加一岁，不足一年的不计。</td></tr>
                                        <tr class="strong"><td>7.2连续投保</td></tr>
                                        <tr><td>指投保人为被保险人不间断连续投保本合同。</td></tr>
                                        <tr class="strong"><td>7.3同时参保</td></tr>
                                        <tr><td>指两名或两名以上家庭成员作为被保险人，填写同一张投保单申请本合同，且被我们同意承保的情况。同时参保的家庭成员应当选择相同保障责任和同一档次的保障水平。</td></tr>
                                        <tr class="strong"><td>7.4有效身份证件</td></tr>
                                        <tr><td>指由政府主管部门规定的证明其身份的证件，如：居民身份证、按规定可使用的有效护照、军官证、警官证、士兵证等证件。</td></tr>
                                        <tr class="strong"><td>7.5住院</td></tr>
                                        <tr><td>指被保险人确因临床需要入住医疗机构之正式病房进行治疗，并正式办理入出院手续，不包括入住门诊观察室、家庭病床、挂床住院及以及休养、疗养、身体检查和健康护理等非治疗性行为导致的住院。我们仅对离开日及以前属于保险责任范围内的住院治疗承担保险金给付责任。</td></tr>
                                        <tr class="strong"><td>7.6意外伤害</td></tr>
                                        <tr><td>指遭受外来的、突发的、非本意的、非疾病的客观事件直接致使身体受到的伤害。</td></tr>
                                        <tr class="strong"><td>7.7医疗必需且合理</td></tr>
                                        <tr><td>指合理的、符合通常惯例且医疗必须的医疗费用。符合通常惯例指被保险人接受的医疗服务满足以下条件：1）该服务满足医疗需要而且根据治疗当地通行治疗规范、采用了通行治疗方法；2）医疗费用没有超过当地对类似情形治疗的常规费用，类似情形是指在同一地区、对相同性别、近似年龄的人所患的同类疾病或身体伤害实施的类似治疗或服务。医疗必需指针对意外伤害或疾病本身的医疗服务及医疗费用满足以下条件：1）治疗意外伤害或疾病合适且必须的、有医生处方的项目；2）与接受治疗当地普遍接受的医疗专业实践标准一致；3）非为了医师或其他医疗提供方的方便；4）接受的医疗服务范围是合适的而且经济有效的。对是否医疗必需由我们理赔人员根据客观、审慎、合理的原则进行审核；如果被保险人对审核结果有不同意见，可由双方认同的权威医学机构或者权威医学专家进行审核鉴定。</td></tr>
                                        <tr class="strong"><td>7.8住院医疗费用</td></tr>
                                        <tr>
                                            <td>
                                                被保险人住院期间发生的医疗费用，包括：
                                                <br>1、床位费：住院期间实际发生的、不高于标准单人病房（或私人病房）的住院床位费（不包括套房、家庭病床）。
                                                <br>2、膳食费：住院期间实际发生的、由医院提供的合理的、符合惯常标准的膳食费用，但不包括住院期间购买的个人用品。
                                                <br>3、护理费：住院期间根据医嘱所示的护理等级确定的护理费用。
                                                <br>在每一保单年度内，我们仅对被保险人住院累计180日内发生的床位费、膳食费、护理费承担保险责任。
                                                <br>4、检查检验费：住院期间实际发生的，以诊断疾病为目的，采取必要的医学手段进行检查及检验而发生的合理的医疗费用，包括诊查费、妇检费、X 光费、心电图费、B 超费、脑电图费、内窥镜费、肺功能仪费、分子生化检查费和血、尿、便常规检查费等。
                                                <br>5、治疗费：住院期间以治疗疾病为目的，提供必要的医学手段而发生的合理的治疗者的技术劳务费和医疗器械使用费，以及消耗品的费用，包括放射疗法费、化学疗法费、注射费、机疗费、理疗费、输血费、输氧费、体外反搏费等。
                                                <br>6、药品费：住院期间实际发生的医疗必需且合理的由医生开具的具有国家药品监督管理部门核发的药品批准文号或者进口药品注册证书、医药产品注册证书的国产或进口药品的费用。
                                                <br>7、医生费：包括外科医生、麻醉师、内科医生、专科医生的费用。
                                                <br>8、非器官移植手术费：住院期间为治疗疾病、挽救生命而施行的非器官移植手术产生的合理的手术医疗费用，包括手术室费、恢复室费、麻醉费、手术监测费、手术辅助费、材料费、一次性用品费、术中用药费、手术设备费。
                                                <br>9、特定器官移植手术费：住院期间出于医学必要被保险人接受肾脏、肝脏、心脏、肺以及造血干细胞移植手术产生的合理手术医疗费用，包括手术室费、恢复室费、麻醉费、手术监测费、手术辅助费、材料费、一次性用品费、术中用药费、手术设备费。
                                                <br>10、重症监护病房床位费：住院期间出于医学必要被保险人需在重症监护室进行医疗必需且合理的医疗而产生的床位费。重症监护室指配有中心监护台、心电监护仪及其他监护抢救设施，相对封闭管理，符合重症监护病房（ICU）、冠心病重症监护病房（CCU）标准的单人或多人监护病房。
                                                <br>11、救护车费：指住院期间以抢救生命或治疗疾病为目的，根据医生建议，被保险人需医院转诊过程中的医院用车费用，且救护车的使用仅限于同一城市中的医疗运送。
                                            </td>
                                        </tr>
                                        <tr class="strong"><td>7.9感染艾滋病病毒或患艾滋病</td></tr>
                                        <tr>
                                            <td>
                                                艾滋病病毒指人类免疫缺陷病毒，英文缩写为HIV。艾滋病指人类免疫缺陷病毒引起的获得性免疫缺陷综合征，英文缩写为AIDS。
                                                在人体血液或其他样本中检测到艾滋病病毒或其抗体呈阳性，没有出现临床症状或体征的，为感染艾滋病病毒；如果同时出现了明显临床症状或体征的，为患艾滋病。
                                            </td>
                                        </tr>
                                        <tr class="strong"><td>7.10既往疾病</td></tr>
                                        <tr>
                                            <td>
                                                指在本主险合同生效之前罹患的被保险人已知或应该知道的有关疾病或症状。通常有以下情况：
                                                <br>1.本主险合同生效前，医生已有明确诊断，长期治疗未间断；
                                                <br>2.本主险合同生效前，医生已有明确诊断，治疗后症状未完全消失，有间断用药情况；
                                                <br>3.本主险合同生效前发生，医生已有明确诊断，但未予治疗；或者未经医生诊断和治疗，但症状明显且持续存在，以普通人医学常识应当知晓。
                                            </td>
                                        </tr>
                                        <tr class="strong"><td>7.11毒品</td></tr>
                                        <tr><td>指《中华人民共和国刑法》规定的鸦片、海洛因、甲基苯丙胺（冰毒）、吗啡、大麻、可卡因以及国家规定管制的其他能够使人形成瘾癖的麻醉药品和精神药品，但不包括由医生开具并遵医嘱使用的用于治疗疾病但含有毒品成分的处方药品。</td></tr>
                                        <tr class="strong"><td>7.12斗殴</td></tr>
                                        <tr><td>指双方或多方通过拳脚、器械等武力以求制胜的行为。关于斗殴的认定，如有司法机关、公安部门的有关法律文件，则以上述法律文件为准。</td></tr>
                                        <tr class="strong"><td>7.13酒后驾驶</td></tr>
                                        <tr><td>指经检测或鉴定，发生事故时车辆驾驶人员每百毫升血液中的酒精含量达到或超过一定的标准，公安机关交通管理部门依据《道路交通安全法》的规定认定为饮酒后驾驶或醉酒后驾驶。</td></tr>
                                        <tr class="strong"><td>7.14无合法有效驾驶证驾驶</td></tr>
                                        <tr>
                                            <td>
                                                指下列情形之一：
                                                <br>(1)没有取得驾驶资格；
                                                <br>(2)驾驶与驾驶证准驾车型不相符合的车辆；
                                                <br>(3)持审验不合格的驾驶证驾驶；
                                                <br>(4)持学习驾驶证学习驾车时，无教练员随车指导，或不按指定时间、路线学习驾车
                                            </td>
                                        </tr>
                                        <tr class="strong"><td>7.15无有效行驶证</td></tr>
                                        <tr>
                                            <td>
                                                指下列情形之一：
                                                <br>(1)未取得行驶证；
                                                <br>(2)机动车被依法注销登记的；
                                                <br>(3)未依法按时进行或通过机动车安全技术检验。
                                            </td>
                                        </tr>
                                        <tr class="strong"><td>7.16机动车</td></tr>
                                        <tr><td>指以动力装置驱动或者牵引，上道路行驶的供人员乘用或者用于运送物品以及进行工程专项作业的轮式车辆。</td></tr>
                                        <tr class="strong"><td>7.17潜水</td></tr>
                                        <tr><td>指以辅助呼吸器材在江、河、湖、海、水库、运河等水域进行的水下运动。</td></tr>
                                        <tr class="strong"><td>7.18攀岩</td></tr>
                                        <tr><td>指攀登悬崖、楼宇外墙、人造悬崖、冰崖、冰山等运动。</td></tr>
                                        <tr class="strong"><td>7.19探险</td></tr>
                                        <tr><td>指明知在某种特定的自然条件下有失去生命或使身体受到伤害的危险，而故意使自己置身于其中的行为，如：江河漂流、徒步穿越沙漠或人迹罕见的原始森林、携带特殊攀登设备从事户外登山等活动。</td></tr>
                                        <tr class="strong"><td>7.20武术比赛</td></tr>
                                        <tr><td>指两人或两人以上对抗性柔道、空手道、跆拳道、散打、拳击等各种拳术及使用器械的对抗性比赛。</td></tr>
                                        <tr class="strong"><td>7.21特技表演</td></tr>
                                        <tr><td>指进行马术、杂技、驯兽等表演。</td></tr>
                                        <tr class="strong"><td>7.22遗传性疾病</td></tr>
                                        <tr><td>指生殖细胞或受精卵的遗传物质（染色体和基因）发生突变或畸变所引起的疾病，通常具有由亲代传至后代的垂直传递的特征。</td></tr>
                                        <tr class="strong"><td>7.23先天性畸形、变形或染色体异常</td></tr>
                                        <tr><td>指被保险人出生时就具有的畸形、变形或染色体异常。先天性畸形、变形和染色体异常依照世界卫生组织《疾病和有关健康问题的国际统计分类》（ICD-10）确定。</td></tr>
                                        <tr class="strong"><td>7.24现金价值</td></tr>
                                        <tr><td>指本合同保险单所具有的价值，通常体现为解除合同时，根据精算原理计算的，由我们退还的那部分金额。现金价值＝本合同的保险费×65％×（1－n/m），其中n为本合同已生效的天数，m为本合同保险期间的天数。合同已生效的天数不足一天的不计。</td></tr>
                                    </tbody>
                                </table>
                            </li>
                        </ul>
                        </div>
                            <div class="insuranceTable">
                            <h3>附表：畅享人生医疗保险计划表(本产品暂时只提供计划1)</h3>
                            <table>
                                <tbody style="font-size: 15px;">
                                    <tr>
                                        <td>&nbsp;</td>
                                        <td>计划1</td>
                                        <td>计划2</td>
                                    </tr>
                                    <tr>
                                        <td><strong>保障区域</strong></td>
                                        <td>中国大陆</td>
                                        <td>中国大陆</td>
                                    </tr>
                                    <tr>
                                        <td><strong>年度总限额</strong></td>
                                        <td>800,000</td>
                                        <td>800,000</td>
                                    </tr>
                                    <tr>
                                        <td><strong>赔付比例 </strong></td>
                                        <td>100%</td>
                                        <td>100%</td>
                                    </tr>
                                    <tr>
                                        <td><strong>年度免赔额</strong></td>
                                        <td>10,000</td>
                                        <td>8,000</td>
                                    </tr>
                                    <tr>
                                        <td>1.住院医疗费用保险金</td>
                                        <td>&nbsp;</td>
                                        <td>&nbsp;</td>
                                    </tr>
                                    <tr>
                                        <td>
                                            床位费、膳食费、护理费
                                            (最多180日/年)
                                        </td>
                                        <td>2,000/日</td>
                                        <td>2,000/日</td>
                                    </tr>
                                    <tr>
                                        <td>检查检验费、治疗费 </td>
                                        <td>同年度总限额</td>
                                        <td>同年度总限额</td>
                                    </tr>
                                    <tr>
                                        <td>药品费</td>
                                        <td>同年度总限额</td>
                                        <td>同年度总限额</td>
                                    </tr>
                                    <tr>
                                        <td>医生费</td>
                                        <td>同年度总限额</td>
                                        <td>同年度总限额</td>
                                    </tr>
                                    <tr>
                                        <td>非器官移植手术费</td>
                                        <td>同年度总限额</td>
                                        <td>同年度总限额</td>
                                    </tr>
                                    <tr>
                                        <td>特定器官移植手术费</td>
                                        <td>300,000/年 </td>
                                        <td>300,000/年 </td>
                                    </tr>
                                    <tr>
                                        <td>重症监护病房床位费</td>
                                        <td>同年度总限额</td>
                                        <td>同年度总限额</td>
                                    </tr>
                                    <tr>
                                        <td>救护车费</td>
                                        <td>同年度总限额</td>
                                        <td>同年度总限额</td>
                                    </tr>
                                    <tr>
                                        <td>2.特殊门诊医疗费用保险金</td>
                                        <td></td>
                                        <td></td>
                                    </tr>
                                    <tr>
                                        <td>门诊肾透析费</td>
                                        <td>100,000/年</td>
                                        <td>100,000/年</td>
                                    </tr>
                                    <tr>
                                        <td>门诊癌症放化疗费</td>
                                        <td>100,000/年</td>
                                        <td>100,000/年</td>
                                    </tr>
                                    <tr>
                                        <td>器官移植后的门诊抗排异治疗费</td>
                                        <td>同年度总限额</td>
                                        <td>同年度总限额</td>
                                    </tr>
                                </tbody>
                            </table>
                        </div>
                    </div>
                </div>
                <section class="submit-button">
                    <x-button type='primary' @click.native='showProvision = false ; agreeProvisionCheck = true'>我已阅读《保险条款》</x-button>
                </section>
            </x-dialog>

        </group>
    </div>
</template>

<script>
import $ from 'zepto';
import { Group, Cell ,XInput ,GroupTitle,XButton,XSwitch,CheckIcon,PopupRadio,DatetimeView,Popup,TransferDom,XDialog} from 'vux'

export default {

    components: {
        Popup,
        CheckIcon,
        Group,
        XDialog,
        DatetimeView,
        PopupRadio,
        Cell,
        XInput,
        GroupTitle,
        XSwitch,
        XButton
    },
    directives: {
        TransferDom
    },

    data () {
        return {
            showPolicyHolderIdentityDate : false,
            showInsuredIdentityDate : false,
            showPolicyHolderBirthDate : false,
            showInsuredBirthDate : false,
            agreeCheck : false,
            agreeTotalCheck : false,
            agreeDeclareCheck : false,
            agreeAttentionCheck : false,
            agreeProvisionCheck : false,
            showDeclare : false,
            showAttention : false,
            showProvision : false,
            sexOptions : ['男','女'],
            provinceOptions : ['安徽省'],
            province : '安徽省',
            insuredRelationOptions : ['本人','父母','配偶','子女'],
            startDate: this.$dateFormat(new Date().getTime()/1000,'yyyy-MM-dd'),
            endDate : '',
            flowData : {
                produceId : '',
                vendorId : '',
                socialInsuFlag : false,
                policyHolderEmail : '',
                policyHolderMobile : '',
                policyHolderAddress : '',
                insuredAddress : '',
                insuredRelation : '本人'
            },
            insured : {
                expiredDate : '',
                identity : '',
                name : '',
                birth : '',
                gender : ''
            },
            policyHolder : {
                expiredDate : '',
                identity : '',
                name : '',
                birth : '',
                gender : ''
            },
            userNameRules : function (value,user) {
                var valid = value.length > 0;
                var msg = '请输入正确的' + user + '姓名';
                if (!valid) {
                    this.$vux.toast.text(msg, 'top')
                }
                return valid;
            },
            identityRules: function (value,user) {
                var reg = /(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}[0-9Xx]$)/;
                var result =  reg.test(value);
                return {
                  valid: result,
                  msg: '请输入正确的' + user + '身份证号'
                }
            },
            userEmailRules : function (value,user) {
                var reg = /^[A-Za-z0-9\u4e00-\u9fa5]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/;
                var result =  reg.test(value);
                return {
                  valid: result,
                  msg: '请输入正确的' + user + '电子邮箱'
                }
            },
            adressRules : function (value,user) {
                return {
                  valid: value.length >= 5,
                  msg: '请输入正确的' + user + '详细地址'
                }
            },
             mobileRules : function (value,user) {
                var reg = /^1[34578]\d{9}$/;
                var result =  reg.test(value);
                return {
                  valid: result,
                  msg: '请输入正确的' + user + '手机号码'
                }
            },
        }
    },

    created () {
        var date = this.$dateFormat(new Date().getTime()/1000,'yyyy-MM-dd').split('-');
        date[0] = parseInt(date[0]) + 100;
        this.endDate = date.join('-');

        var liAnFlowData = this.storage.get('liAnFlowData');
        if (liAnFlowData) {
            if (liAnFlowData.produceId){
                this.flowData.produceId = liAnFlowData.produceId;
            }
            if (liAnFlowData.vendorId){
                this.flowData.vendorId = liAnFlowData.vendorId;
            }
            if (liAnFlowData.socialInsuFlag){
                this.flowData.socialInsuFlag = liAnFlowData.socialInsuFlag;
            }
            if (liAnFlowData.policyHolderEmail){
                this.flowData.policyHolderEmail = liAnFlowData.policyHolderEmail;
            }
            if (liAnFlowData.policyHolderMobile){
                this.flowData.policyHolderMobile  = liAnFlowData.policyHolderMobile;
            }
            if (liAnFlowData.policyHolderAddress){
                this.flowData.policyHolderAddress = liAnFlowData.policyHolderAddress;
            }
            if (liAnFlowData.insuredAddress){
                this.flowData.insuredAddress = liAnFlowData.insuredAddress;
            }
            if (liAnFlowData.insuredRelation){
                this.flowData.insuredRelation = liAnFlowData.insuredRelation;
            }
            if (liAnFlowData.policyHolder){
                this.flowData.policyHolder = liAnFlowData.policyHolder;
            }
            if (liAnFlowData.insured){
                this.flowData.insured = liAnFlowData.insured;
            }
            this.flowData.socialInsuFlag = Boolean(liAnFlowData.socialInsuFlag);
        }
    },

    mounted :function(){
        // var arr = ["1966-09-27","1967-08-29","1967-09-27","1967-09-28","1967-09-29","1967-10-27","1968-09-29","2011-09-27","2012-08-27","2012-09-27","2012-09-28","2012-09-29","2012-10-27","2013-09-27"];
        // debugger;
        // for (var i = 0; i < arr.length; i++) {
        //     console.log(Number(this.judgeAge(arr[i])));
        // }
    },

    methods : {
        policyHolderIdentityChange () {

            if (this.flowData.insuredRelation == '本人') {
                var identity = this.policyHolder.identity;
                this.insured.identity = identity;
            }

            if (this.identityRules(this.policyHolder.identity,"投保人").valid){
                if (this.policyHolder.identity.length == 18){
                    this.policyHolder.birth =
                        this.policyHolder.identity.substr(6,4) + "-" +
                        this.policyHolder.identity.substr(10,2) + "-" +
                        this.policyHolder.identity.substr(12,2);
                    if (this.policyHolder.identity.substr(16,1) % 2) {
                        this.policyHolder.gender = '男';
                    } else {
                        this.policyHolder.gender = '女';
                    }
                }
            }
        },
        insuredIdentityChange () {
            if (this.identityRules(this.insured.identity,"被保人").valid){
                if (this.insured.identity.length == 18) {
                    this.insured.birth =
                        this.insured.identity.substr(6,4) + "-" +
                        this.insured.identity.substr(10,2) + "-" +
                        this.insured.identity.substr(12,2);

                    if (!this.judgeAge(this.insured.birth)){
                        this.$vux.toast.text('抱歉，暂时仅支持被保人5-49周岁的投保', 'top');
                    }
                    if (this.insured.identity.substr(16,1) % 2) {
                        this.insured.gender = '男';
                    } else {
                        this.insured.gender = '女';
                    }
                }
            }
        },
        judgeAge (birth) {
            let brithArray = birth.split('-');
            let byear = brithArray[0];
            let bmouth = brithArray[1];
            let bday = brithArray[2];
            let nowDate = new Date();
            let nyear = nowDate.getFullYear();
            let nmouth = nowDate.getMonth() + 1;
            let nday = nowDate.getDate();

            if ((nyear - byear) > 5 && (nyear - byear) <= 49) {
                return true;
            } else if ((nyear - byear) < 5 || ((nyear - byear) > (49 + 1))) {
                return false;
            } else {
                //两种情况  一个是 5岁那年 , 一个是50岁那年
                if ((nyear - byear) == 5) {
                    //5岁那年
                    if ((nmouth - bmouth) > 0){
                        return true;
                    } else if ((nmouth - bmouth) < 0){
                        return false;
                    }else {
                        if ((nday - bday) > 0){
                            return true;
                        } else {
                            return false;
                        }
                    }
                } else {
                    //50岁那年
                    if ((nmouth - bmouth) > 0){
                        return false;
                    } else if ((nmouth - bmouth) < 0){
                        return true;
                    }else {
                        if ((nday - bday) >= 0){
                            return false;
                        } else {
                            return true;
                        }
                    }
                }
            }
        },
        insuredRelationChange (value) {
            if (value == '本人'){
                var policy = {};
                policy = $.extend(true, policy, this.policyHolder);
                this.insured = policy;
                var adress = this.flowData.policyHolderAddress
                this.flowData.insuredAddress = adress;
            }
        },
        policyHolderNameChange () {
            if (this.flowData.insuredRelation == '本人') {
                var name = this.policyHolder.name;
                this.insured.name = name;
            }
        },
        policyHolderIdentityDateChange () {
            if (this.flowData.insuredRelation == '本人') {
                var expiredDate = this.policyHolder.expiredDate;
                this.insured.expiredDate = expiredDate;
            }
        },
        policyHolderBirthDateChange () {
            if (this.flowData.insuredRelation == '本人') {
                var birth = this.policyHolder.birth;
                this.insured.birth = birth;
            }
        },
        policyHolderGenderChange () {
            if (this.flowData.insuredRelation == '本人') {
                var gender = this.policyHolder.gender;
                this.insured.gender = gender;
            }
        },
        policyHolderAddressChange () {
            if (this.flowData.insuredRelation == '本人') {
                var adress = this.flowData.policyHolderAddress;
                this.flowData.insuredAddress = adress;
            }
        },
        getInsuredRelationType (relation) {
            switch (relation) {
                case '本人' : {
                    return 'SELF';
                }
                case '父母' : {
                    return 'PARENT';
                }
                case '配偶' : {
                    return 'LOVER';
                }
                case '子女' : {
                    return 'CHILD'
                }
            }
        },
        agreeTotalDeclare (value) {
            this.agreeCheck = false;
            if (this.agreeAttentionCheck && this.agreeDeclareCheck && this.agreeProvisionCheck) {
                this.agreeTotalCheck = !this.agreeTotalCheck;
                this.agreeCheck = this.agreeTotalCheck;
            }else {
                if (!this.agreeDeclareCheck){
                    this.$vux.toast.text('必须点击阅读《投保声明》', 'top');
                }else if (!this.agreeAttentionCheck) {
                    this.$vux.toast.text('必须点击阅读《理赔须知》', 'top');
                }else {
                    this.$vux.toast.text('必须点击阅读《保险条款》', 'top');
                }
                this.agreeTotalCheck = false;
            }
        },
        takePhotoToUserInformation (category) {
            if (category == 2 && this.flowData.insuredRelation == '本人') return;
            var _this = this;
            _this.$uploadImage( function (serverId,localId) {
                _this.$post(_this.host_bdd + '/autoInsurance/v1/upload/identity', {
                    mediaId: serverId,
                }, function (rt) {
                    _this.$vux.loading.hide();
                    if (rt.data.code != 200) {
                        _this.$vux.toast.text(rt.data.error, 'top');
                        return;
                    }
                    if (rt.data.certPersonIdentity){
                        if (category == 1){
                            _this.policyHolder.expiredDate = rt.data.certPersonIdentity.expiredDate;
                            _this.policyHolder.identity = rt.data.certPersonIdentity.identity;
                            _this.policyHolder.name = rt.data.certPersonIdentity.name;
                            _this.policyHolder.birth = rt.data.certPersonIdentity.birth;
                            _this.policyHolder.gender = rt.data.certPersonIdentity.gender;
                        }else if (category == 2){
                            _this.insured.expiredDate = rt.data.certPersonIdentity.expiredDate;
                            _this.insured.identity = rt.data.certPersonIdentity.identity;
                            _this.insured.name = rt.data.certPersonIdentity.name;
                            _this.insured.birth = rt.data.certPersonIdentity.birth;
                            _this.insured.gender = rt.data.certPersonIdentity.gender;
                        }
                    }
                });
            });
        },
        submitInfo () {

            if (this.userNameRules(this.policyHolder.name,'投保人')
                && this.userNameRules(this.insured.name,'被保人')){

                if (!this.policyHolder.expiredDate) {
                    this.$vux.toast.text('请输入正确的投保人身份证有效期', 'top');
                    return;
                }

                if (!this.insured.expiredDate) {
                    this.$vux.toast.text('请输入正确的被保人身份证有效期', 'top');
                    return;
                }

                var policyHolderValid = this.identityRules(this.policyHolder.identity,'投保人');
                if (!policyHolderValid.valid) {
                    this.$vux.toast.text(policyHolderValid.msg, 'top');
                    return;
                }

                var insuredValid = this.identityRules(this.insured.identity,'被保人');
                if (!insuredValid.valid) {
                    this.$vux.toast.text(insuredValid.msg, 'top');
                    return;
                }

                if (!this.judgeAge(this.insured.birth)){
                    this.$vux.toast.text('抱歉，暂时仅支持被保人5-49周岁的投保', 'top');
                    return;
                }

                if (!this.policyHolder.birth) {
                    this.$vux.toast.text('请输入正确的投保人出生日期', 'top');
                    return;
                }

                if (!this.insured.birth) {
                    this.$vux.toast.text('请输入正确的被保人出生日期', 'top');
                    return;
                }

                if(!this.policyHolder.gender){
                    this.$vux.toast.text('请输入正确的投保人性别', 'top');
                    return;
                }

                if(!this.insured.gender){
                    this.$vux.toast.text('请输入正确的被保人性别', 'top');
                    return;
                }

                if(!this.userEmailRules(this.flowData.policyHolderEmail).valid){
                    this.$vux.toast.text('请输入正确的投保人电子邮件', 'top');
                    return;
                }

                if(!this.adressRules(this.flowData.policyHolderAddress).valid){
                    this.$vux.toast.text('请输入正确的投保人详细地址', 'top');
                    return;
                }

                if(!this.adressRules(this.flowData.insuredAddress).valid){
                    this.$vux.toast.text('请输入正确的被保人详细地址', 'top');
                    return;
                }

                if(!this.mobileRules(this.flowData.policyHolderMobile).valid){
                    this.$vux.toast.text('请输入正确的投保人手机号码', 'top');
                    return;
                }

                if (!this.agreeCheck){
                    this.$vux.toast.text('必须同意遵守投保声明，理赔须知，保险条款', 'top');
                    return;
                }

                this.flowData.insured = this.insured;
                this.flowData.policyHolder = this.policyHolder;

                var liAnFlowData = {};
                liAnFlowData = $.extend(true, liAnFlowData, this.flowData);
                liAnFlowData.insuredRelation = this.getInsuredRelationType(liAnFlowData.insuredRelation);
                liAnFlowData.socialInsuFlag = Number(liAnFlowData.socialInsuFlag);

                this.$vux.loading.show({
                    text: '正在提交数据'
                });
                var _this = this;
                this.$http.post(this.host_bdd + '/lifeInsurance/v1/cx', liAnFlowData).then((rt) => {
                    _this.$vux.loading.hide();
                    if (rt.data.code != 200) {
                        _this.$vux.toast.text(rt.data.error, 'top');
                        return;
                    }
                    var lianProduceData = {
                        "produceId" : liAnFlowData.produceId,
                        "vendorId" : liAnFlowData.vendorId,
                        "socialInsuFlag" : liAnFlowData.haveHealthInsurance
                    }
                    _this.storage.set('liAnFlowData', lianProduceData);
                    _this.$router.replace({ path: '/product/lian/complete', query : {
                        orderId : rt.data.orderId,
                        payUrl : rt.data.payUrl,
                    }});
                });
            }
        }
    }
}
</script>
